<?php
/**
 * خروجی معادل با منابع یافت نشده
 * 
 * در صورتی که یک منبع مورد درخواست کاربر یافت نشود، از این خروجی به عنوان نتیجه
 * استفاده خواهد شد.
 * این کلاس به صورت داخلی در سیستم استفاده می‌شود.
 * 
 * @author maso
 *
 */
class HM_HTTP_Response_NotFound extends Pluf_HTTP_Response_Json
{
	/**
	 * یک نمونه جدید از این شئی ایجاد می‌کند
	 * 
	 * در فرآیند ساخت تلاش می‌شو که الگویی برای خطای 404 بازیابی شده و به عنوان نتیجه
	 * برگردانده شود.
	 * در صورتی که خطایی رخ دهد، یک متن پیش فرض به عنوان خطای نتیجه نمایش داده خواهد شد.
	 * 
	 * @param unknown $request
	 */
    function __construct($request)
    {
        $data = 
        parent::__construct($content);
        $this->status_code = 404;
    }
}
